TuranKavakURLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["shortened_url_id", 2], ["created_at", "2020-03-03 03:43:23.427203"], ["updated_at", "2020-03-03 03:43:23.427203"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)